<a href="https://colab.research.google.com/github/4dsolutions/clarusway_data_analysis/blob/main/DAwPy_S11_(RegEx%2C%20Data%20Input%20_Output)/DAwPy-S11-Part-02%20(Data%20Input%20and%20Output).ipynb"><img align="left" src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open in Colab" title="Open and Execute in Google Colaboratory"></a><br/>
[![nbviewer](https://raw.githubusercontent.com/jupyter/design/master/logos/Badges/nbviewer_badge.svg)](https://nbviewer.org/github/4dsolutions/clarusway_data_analysis/blob/main/DAwPy_S11_%28RegEx%2C%20Data%20Input%20_Output%29/DAwPy-S11-Part-02%20%28Data%20Input%20and%20Output%29.ipynb)

________


<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

<img src=https://i.ibb.co/6gCsHd6/1200px-Pandas-logo-svg.png width="700" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">Data Analysis with Python</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:150%; text-align:center; border-radius:10px 10px;">Session - 11 (Part - 02)</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#4d77cf; font-size:200%; text-align:center; border-radius:10px 10px;">Data Input & Output</p>

<a id="toc"></a>

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Content</p>

* [IMPORTING LIBRARIES NEEDED IN THIS NOTEBOOK](#0)
* [DATA INPUT & OUTPUT](#1)
* [CSV INPUT & OUTPUT](#2)
* [EXCEL INPUT & OUTPUT](#3)    
* [HTML INPUT & OUTPUT](#4)
* [SQL CONNECTIONS](#5)
* [THE END OF THE SESSION - 07](#6)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Importing Libraries Needed in This Notebook</p>

<a id="0"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Once you've installed NumPy & Pandas you can import them as a library:

In [2]:
import numpy as np
import pandas as pd

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Data Input & Output</p>

<a id="1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

**Find where you work and the current directory**

**``pwd``** is a bash shell command, that's why it was available in the terminal, because bash is what the terminal uses. You CANNOT directly invoke Bash commands from Python because they're different programming languages. But Python has a "get current working directory" function too, in the os module.

In [3]:
pwd

'/Users/kirbyurner/Documents/clarusway_data_analysis/DAwPy_S11_(RegEx, Data Input _Output)'

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">CSV Input & Output</p>

<a id="2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

[How can I open and read a CSV file in python?](https://realpython.com/pandas-read-write-files/)

## CSV Input

In [4]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4   0   1   2   3
5   4   5   6   7
6   8   9  10  11
7  12  13  14  15

In [5]:
# You can read the csv as a dictionary format by means of csv.DictReader.

import csv

reader = csv.DictReader(open('example.csv'))  # becomes exhausted with use, must be refreshed

In [6]:
reader

In [7]:
for x in reader:
    print(x)

{'a': '0', 'b': '1', 'c': '2', 'd': '3'}
{'a': '4', 'b': '5', 'c': '6', 'd': '7'}
{'a': '8', 'b': '9', 'c': '10', 'd': '11'}
{'a': '12', 'b': '13', 'c': '14', 'd': '15'}
{'a': '0', 'b': '1', 'c': '2', 'd': '3'}
{'a': '4', 'b': '5', 'c': '6', 'd': '7'}
{'a': '8', 'b': '9', 'c': '10', 'd': '11'}
{'a': '12', 'b': '13', 'c': '14', 'd': '15'}

**What is the difference between CSV reader and CSV DictReader?**

The **``DictReader()``** is used to read the file of the csv in the format of the dict object. class csv.DictReader creates an object that operates like a regular reader but maps the information in each row to a dict whose keys are given by the optional fieldnames parameter.

**``csv.Reader()``** allows you to access CSV data using indexes and is ideal for simple CSV files. **``csv.DictReader()``** on the other hand is friendlier and easy to use, especially when working with large CSV files [Source 01](https://realpython.com/lessons/reading-csvs-pythons-csv-module/), [Source 02](https://docs.python.org/3/library/csv.html), [Source 03](https://courses.cs.washington.edu/courses/cse140/13wi/csv-parsing.html) & [Source 04](https://linuxhint.com/use-python-csv-dictreader/).

In [8]:
import warnings
warnings.simplefilter(action='ignore', category=FutureWarning)

In [9]:
df3 = pd.DataFrame()
reader = csv.DictReader(open('example.csv'))

for row in reader:
    df3 = df3.append(row, ignore_index=True)

df3

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4   0   1   2   3
5   4   5   6   7
6   8   9  10  11
7  12  13  14  15

In [10]:
df3 = pd.DataFrame()
reader = csv.DictReader(open('example.csv'))

rows = []
for row in reader:
    rows.append(pd.DataFrame(pd.Series(row)).T)
df3 = pd.concat(rows, ignore_index=True)
df3

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4   0   1   2   3
5   4   5   6   7
6   8   9  10  11
7  12  13  14  15

In [11]:
pd.read_csv("ornekcsv.csv")

       a;b;c
0    78;12;1
1    78;12;2
2   78;324;3
3      7;2;4
4    88;23;5
5       6;2;
6    56;11;6
7     7;12;7
8    56;21;7
9    346;2;8
10     5;1;8
11  456;21;8
12   3;12;88

In [12]:
pd.read_csv("ornekcsv.csv", sep=';')

      a    b     c
0    78   12   1.0
1    78   12   2.0
2    78  324   3.0
3     7    2   4.0
4    88   23   5.0
5     6    2   NaN
6    56   11   6.0
7     7   12   7.0
8    56   21   7.0
9   346    2   8.0
10    5    1   8.0
11  456   21   8.0
12    3   12  88.0

In [13]:
pd.read_csv("ornekcsv.csv", sep=';', index_col=0)

       b     c
a
78    12   1.0
78    12   2.0
78   324   3.0
7      2   4.0
88    23   5.0
6      2   NaN
56    11   6.0
7     12   7.0
56    21   7.0
346    2   8.0
5      1   8.0
456   21   8.0
3     12  88.0

**``usecols=``** & **``nrows=``** parameters

In [14]:
# Return a subset of the columns.
# Number of rows of file to read. Useful for reading pieces of large files.

pd.read_csv("ornekcsv.csv", sep = ";", usecols=['a', 'b'], nrows=10)

     a    b
0   78   12
1   78   12
2   78  324
3    7    2
4   88   23
5    6    2
6   56   11
7    7   12
8   56   21
9  346    2

In [15]:
pd.read_csv("titanic.csv")

                        PassengerId\tSurvived\tPclass\tName\tSex\tAge\tSibSp\tParch\tTicket\tFare\tCabin\tEmbarked
1\t0\t3\tBraund           Mr. Owen Harris\tmale\t22\t1\t0\tA/5 21171\t7...
2\t1\t1\tCumings          Mrs. John Bradley (Florence Briggs Thayer)\tf...
3\t1\t3\tHeikkinen        Miss. Laina\tfemale\t26\t0\t0\tSTON/O2. 31012...
4\t1\t1\tFutrelle         Mrs. Jacques Heath (Lily May Peel)\tfemale\t3...
5\t0\t3\tAllen            Mr. William Henry\tmale\t35\t0\t0\t373450\t8....
...                                                                    ...
152\t1\t1\tPears          Mrs. Thomas (Edith Wearne)\tfemale\t22\t1\t0\...
153\t0\t3\tMeo            Mr. Alfonzo\tmale\t55.5\t0\t0\tA.5. 11206\t8....
154\t0\t3\tvan Billiard   Mr. Austin Blyler\tmale\t40.5\t0\t2\tA/5. 851...
155\t0\t3\tOlsen          Mr. Ole Martin\tmale\t\t0\t0\tFa 265302\t7.31...
156\t0\t1\tWilliams       Mr. Charles Duane\tmale\t51\t0\t1\tPC 17597\t...

[156 rows x 1 columns]

In [16]:
pd.read_csv("titanic.csv", sep = "\t")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

## CSV Output

**``Writing a pandas DataFrame to CSV file``** [Source 01](https://stackoverflow.com/questions/16923281/writing-a-pandas-dataframe-to-csv-file) & [Source 02](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_csv.html)

In [17]:
# pandas.DataFrame.to_csv writes object to a comma-separated values (csv) file.

df.to_csv('example.csv')

In [18]:
pd.read_csv("example.csv")

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15
4           4   0   1   2   3
5           5   4   5   6   7
6           6   8   9  10  11
7           7  12  13  14  15

In [19]:
pd.read_csv("example.csv", index_col = 0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4   0   1   2   3
5   4   5   6   7
6   8   9  10  11
7  12  13  14  15

In [20]:
df.to_csv('example.csv', index = False)

In [21]:
pd.read_csv("example.csv")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4   0   1   2   3
5   4   5   6   7
6   8   9  10  11
7  12  13  14  15

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Excel Input & Output</p>

<a id="3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash. 

[How can I open and read an Excel file in python?](https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html)

## Excel Input

In [22]:
# default sheet_name is 0. It means the first sheet comes into.

df1 = pd.read_excel('Excel_Sample.xlsx')
df1

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [23]:
df2 = pd.read_excel('Excel_Sample.xlsx', sheet_name = "Sheet2")
df2

    a   b    c   d
0  11  55  123   3
1  22  66  234   7
2  33  77  456  11
3  44  88  678  15

In [24]:
df3 = pd.read_excel('Excel_Sample.xlsx', sheet_name = None)
df3

{'Sheet1':     a   b   c   d
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15,
 'Sheet2':     a   b    c   d
 0  11  55  123   3
 1  22  66  234   7
 2  33  77  456  11
 3  44  88  678  15}

In [25]:
type(df3)

dict

In [26]:
pd.ExcelFile('Excel_Sample.xlsx').sheet_names

['Sheet1', 'Sheet2']

## Excel Output

**``Writing a pandas DataFrame to Excel file``** [Source 01](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_excel.html) & [Source 02](https://pythonexamples.org/pandas-write-dataframe-to-excel-sheet/)

In [27]:
df1.to_excel('Excel_Sample1.xlsx', sheet_name='Sheet1', index = False)

In [34]:
df2.to_excel("Excel_Sample1.xlsx", sheet_name = "Sheet2", index = False)

In [35]:
with pd.ExcelWriter('combined_df.xlsx') as writer:
    df1.to_excel(writer, sheet_name='sample1', index=False)
    df2.to_excel(writer, sheet_name='sample2', index=True)

In [36]:
pd.read_excel("combined_df.xlsx", sheet_name = "sample1")

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [37]:
pd.read_excel("combined_df.xlsx", sheet_name = "sample2")

   Unnamed: 0   a   b    c   d
0           0  11  55  123   3
1           1  22  66  234   7
2           2  33  77  456  11
3           3  44  88  678  15

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">HTML Input & Output</p>

<a id="4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash. 

[How can I open and read an HTML file in Pandas?](https://pandas.pydata.org/pandas-docs/version/0.23/generated/pandas.read_html.html)

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

## HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects [Source](https://pandas.pydata.org/docs/reference/api/pandas.read_html.html):

In [ ]:
#pip install lxml

In [38]:
df = pd.read_html('https://www.bbc.com/news/world-51235105')

In [39]:
type(df)

list

In [40]:
len(df)

2

In [41]:
type(df[0])

pandas.core.frame.DataFrame

In [42]:
df[0]

,Country,Deaths,Death rate*,Total Cases,New Cases 0 10 100 1k 10k **,Unnamed: 5
0,US,1012833,308.6,87030788,NaN,NaN
1,Brazil,672033,318.4,32535923,NaN,NaN
2,India,525242,38.4,43531650,NaN,NaN
3,Russia,373595,258.8,18173480,NaN,NaN
4,Mexico,325793,255.4,6093835,NaN,NaN
...,...,...,...,...,...,...
220,Micronesia,0,0.0,38,NaN,NaN
221,Vatican,0,0.0,29,NaN,NaN
222,Marshall Islands,0,0.0,18,NaN,NaN
223,Antarctica,0,NaN,11,NaN,NaN
224,Saint Helena,0,0.0,4,NaN,NaN

In [ ]:
df[0].columns

In [43]:
df2=pd.read_html('https://www.imdb.com/chart/top/')
df2

[     Unnamed: 0                          Rank & Title  IMDb Rating  \
 0           NaN  1.  The Shawshank Redemption  (1994)          9.2
 1           NaN             2.  The Godfather  (1972)          9.2
 2           NaN           3.  The Dark Knight  (2008)          9.0
 3           NaN     4.  The Godfather Part II  (1974)          9.0
 4           NaN              5.  12 Angry Men  (1957)          8.9
 ..          ...                                   ...          ...
 245         NaN          246.  The Handmaiden  (2016)          8.0
 246         NaN                 247.  Aladdin  (1992)          8.0
 247         NaN                  248.  Gandhi  (1982)          8.0
 248         NaN                249.  The Help  (2011)          8.0
 249         NaN          250.  The Iron Giant  (1999)          8.0

                             Your Rating  Unnamed: 4
 0    12345678910 NOT YET RELEASED  Seen         NaN
 1    12345678910 NOT YET RELEASED  Seen         NaN
 2    12345678910 NOT YET RELEASED  Seen         NaN
 3    12345678910 NOT YET RELEASED  Seen         NaN
 4    12345678910 NOT YET RELEASED  Seen         NaN
 ..                                  ...         ...
 245  12345678910 NOT YET RELEASED  Seen         NaN
 246  12345678910 NOT YET RELEASED  Seen         NaN
 247  12345678910 NOT YET RELEASED  Seen         NaN
 248  12345678910 NOT YET RELEASED  Seen         NaN
 249  12345678910 NOT YET RELEASED  Seen         NaN

 [250 rows x 5 columns]]

In [44]:
df2[0]

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
0,NaN,1. The Shawshank Redemption (1994),9.2,12345678910 NOT YET RELEASED Seen,NaN
1,NaN,2. The Godfather (1972),9.2,12345678910 NOT YET RELEASED Seen,NaN
2,NaN,3. The Dark Knight (2008),9.0,12345678910 NOT YET RELEASED Seen,NaN
3,NaN,4. The Godfather Part II (1974),9.0,12345678910 NOT YET RELEASED Seen,NaN
4,NaN,5. 12 Angry Men (1957),8.9,12345678910 NOT YET RELEASED Seen,NaN
...,...,...,...,...,...
245,NaN,246. The Handmaiden (2016),8.0,12345678910 NOT YET RELEASED Seen,NaN
246,NaN,247. Aladdin (1992),8.0,12345678910 NOT YET RELEASED Seen,NaN
247,NaN,248. Gandhi (1982),8.0,12345678910 NOT YET RELEASED Seen,NaN
248,NaN,249. The Help (2011),8.0,12345678910 NOT YET RELEASED Seen,NaN
249,NaN,250. The Iron Giant (1999),8.0,12345678910 NOT YET RELEASED Seen,NaN

## HTML Output

**``Render a DataFrame as an HTML table``** [Source 01](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_html.html) & [Source 02](https://stackabuse.com/reading-and-writing-html-tables-with-pandas/)

In [ ]:
df2[0].to_html('simple.html',index=False)

## <p style="background-color:#9d4f8c; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">SQL Connections</p>

<a id="5"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

[Python - Database Connectivity](https://www.knowledgehut.com/tutorials/python-tutorial/python-database-connectivity)

## SQLite Connection with Python¶

In [ ]:
#pip install sqlalchemy

In [ ]:
from sqlalchemy import create_engine

In [ ]:
temp_db = create_engine('sqlite:///:memory:')

The above engine creates a **Dialect object** tailored towards sqlite, as well as a **Pool object** which will establish a DB-API connection at local memory when a connection request is first received. 

**NOTE :** DB-API is an acronym for DataBase Application Programming Interface and a library that lets Python connect to the database server.

In [ ]:
temp_db.table_names()

In [ ]:
tables = pd.read_html('https://en.wikipedia.org/wiki/World_population')

In [ ]:
# tables

In [ ]:
tables[6]

In [ ]:
tables[6].to_sql(name='populations', con=temp_db)

In [ ]:
temp_db.table_names()

**How can I open and read a SQL file in python?**

In [ ]:
pd.read_sql(sql='populations', con=temp_db)

**How can I make a SQL query in python?**

In [ ]:
pd.read_sql_query(sql="SELECT Country, Population FROM populations", con=temp_db)

In [ ]:
import sqlite3

In [ ]:
df = pd.read_excel('Excel_Sample.xlsx')
df

In [ ]:
with sqlite3.connect('sample_data.db') as cnnt:
    df.to_sql('sample3', cnnt, if_exists = 'replace')

In [ ]:
query = 'SELECT a, b FROM sample3'

In [ ]:
with sqlite3.connect('sample_data.db') as cnnt:
    df5 = pd.read_sql_query(query, cnnt)

In [ ]:
df5

## More Fun with SQLite

In [45]:
import sqlite3
conn = sqlite3.connect('roller_coasters.db')
conn

In [46]:
pd.read_sql(sql="SELECT * FROM Coasters", con=conn)

,Name,Park,State,Country,Duration,Speed,Height,VertDrop,Length,Yr_Opened,Inversions
0,Top Thrill Dragster,Cedar Point,Ohio,USA,60,120.0,420.0,400.00,2800.00,2003,0
1,Superman The Escape,Six Flags Magic Mountain,California,USA,28,100.0,415.0,328.10,1235.00,1997,0
2,Millennium Force,Cedar Point,Ohio,USA,165,93.0,310.0,300.00,6595.00,2000,0
3,Goliath,Six Flags Magic Mountain,California,USA,180,85.0,235.0,255.00,4500.00,2000,0
4,Titan,Space World,Kitakyushu,Japan,180,71.5,166.0,178.00,5019.67,1994,0
...,...,...,...,...,...,...,...,...,...,...,...
71,Oblivion,Alton Towers,Alton,England,75,68.0,65.0,180.00,1222.00,1998,0
72,Stunt Fall,Warner Bros. Movie World,San Martin de la Vega,Spain,92,65.6,191.6,177.00,1204.00,2002,3
73,Hayabusa,Tokyo SummerLand,Tokyo,Japan,108,60.3,137.8,124.67,2559.10,1992,0
74,Top Gun,Paramount Canada's Wonderland,Vaughan,Canada,125,56.0,102.0,93.00,2170.00,1995,5
75,Wild Beast,Paramount Canada's Wonderland,Vaughan,Canada,150,56.0,415.0,78.00,3150.00,1981,0

## MSSQL Connection with Python

As we all know, one of the most widely used databases is Microsoft SQL Server. In this part of our session, we will run a simple SELECT query by connecting to the MSSQL Server database with Python, one of the languages widely used in data science studies.

- **Step 1:** Import pyodbc in your Python Script. ...
- **Step 2:** Set the Connection String. ...
- **Step 3:** Create a Cursor Object from our Connection and Execute the SQL Command. ...
- **Step 4:** Retrieve the Query Results from the Cursor.

In [ ]:
#!pip install pypyodbc

import pypyodbc

### Connection with Windows Authentication

In [ ]:
# db = pypyodbc.connect(
#    'Driver={SQL Server};'
#    'Server=serveradi;'
#    'Database=veritabaniadi;'
#    'Trusted_Connection=True;')

### Connection with SQL Server Authentication

In [ ]:
db = pypyodbc.connect(
     'Driver={SQL Server};'
     'Server=DESKTOP-RV0P6OM;'
     'Database=BikeStores;'
     'UID=sa;'
     'PWD=Sd110307;'
)

In [ ]:
db = pypyodbc.connect(
    'Driver={SQL Server};'
    'Server=DESKTOP-HNUHM85;'
    'Database=BikeStores;'
    'UID=sa;'
    'PWD=16Hek72$;'
)

In [ ]:
cursor = db.cursor()

In [ ]:
cursor.execute('SELECT * FROM sales.customers')

In [ ]:
# customers = cursor.fetchone()
# customers

In [ ]:
customers = cursor.fetchall()
customers

In [ ]:
for i in customers:
    print(i)

In [ ]:
cursor.execute("select * from sales.customers")
result = cursor.fetchall()
num_fields = len(cursor.description)
field_names = [i[0] for i in cursor.description]
print(field_names)

In [ ]:
df = pd.DataFrame(customers, columns=["customer_id", "first_name", "last_name", "phone", "email", "street", "city", "state", "zip_code"])
df

In [ ]:
df = pd.read_sql_query('SELECT * FROM sales.customers', db)
df

In [ ]:
cursor.close()
db.close()

## BONUS

In [ ]:
db = pypyodbc.connect(
    'Driver={SQL Server};'
    'Server=DESKTOP-HNUHM85;'
    'Database=BikeStores;'
    'UID=sa;'
    'PWD=16Hek72$;'
)

In [ ]:
orders = pd.read_sql_query('SELECT * FROM sales.orders', db).to_csv('orders.csv', index = False)
order_items = pd.read_sql_query('SELECT * FROM sales.order_items', db).to_csv('order_items.csv', index = False)
staffs = pd.read_sql_query('SELECT * FROM sales.staffs', db).to_csv('staffs.csv', index = False)
stores = pd.read_sql_query('SELECT * FROM sales.stores', db).to_csv('stores.csv', index = False)
visits = pd.read_sql_query('SELECT * FROM sales.visits', db).to_csv('visits.csv', index = False)

In [ ]:
pd.read_csv('orders.csv')

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:150%; text-align:center; border-radius:10px 10px;">The End of The Session - 11 (Part - 02)</p>

<a id="6"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

<p style="text-align: center;"><img src="https://docs.google.com/uc?id=1lY0Uj5R04yMY3-ZppPWxqCr5pvBLYPnV" class="img-fluid" 
alt="CLRSWY"></p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#9d4f8c; font-size:100%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

____